# Model
from sklearn.feature_extraction.text import TfidfVectorizer
from tensorflow import keras
from keras.layers import Dense
from keras.models import Sequential, load_model
import numpy as np
# tokenizer

import joblib
import time

import pythainlp as pythai
from keras.preprocessing.text import Tokenizer
from keras.preprocessing.sequence import pad_sequences

model_svm = joblib.load('./lib/weight/title_body_svm_model.pkl')

vectorizer = joblib.load('./lib/weight/title&body_svm_vectorizer.joblib')

def predict_tb_svm(text, body):
     
    text_to_predict_tfidf = vectorizer.transform([text + ' ' + body])  

    start_time = time.time() 
    predicted_label = model_svm.predict(text_to_predict_tfidf)
    end_time = time.time() 
    prediction_time = end_time - start_time
    print("เวลาที่ใช้ในการทำนาย: {:.2f} วินาที".format(prediction_time))

    sentiment = 'ข่าวจริง' if predicted_label[0] == 1 else 'ข่าวปลอม'
    return sentiment

#print(predict_tb_svm("สมศักดิ์ยัน รบ.ให้ความสำคัญกลุ่มชาติพันธุ์ พัฒนาชีวิต-ความเท่าเทียม", "เมื่อวันที่ 26 เม.ย. 67 นายสมศักดิ์ เทพสุทิน รองนายกรัฐมนตรี ในฐานะประธานคณะกรรมการขับเคลื่อนการฟื้นฟูวิถีชีวิตกลุ่มชาติพันธุ์ชาวเลและชาวกะเหรี่ยง พร้อมด้วย นายสุรสีห์ กิตติมณฑล เลขาธิการสำนักงานทรัพยากรน้ำแห่งชาติ (สทนช.), พล.ต.ต.บรรพต มุ่งขอบกลาง รองผู้บัญชาการตำรวจตระเวนชายแดน, และนายอภินันท์ ธรรมเสนา ผู้จัดการฝ่ายสื่อสารสังคมและขับเคลื่อนนโยบายสาธารณะศูนย์มนุษยวิทยาสิรินธร (องค์การมหาชน) ลงพื้นที่บ้านขุนแม่เหว่ย (แม่ปอคี) อ.ท่าสองยาง จ.ตาก โดยมีหัวหน้าส่วนราชการ เครือข่ายภาคประชาสังคม พี่น้องกลุ่มชาติพันธุ์กะเหรี่ยงบ้านขุนแม่เหว่ย (แม่ปอคี) นายดิษฐ์ชัย สันติกุล อดีตรองนายกองค์การบริหารส่วนจังหวัดตาก และนายชัยณรงค์ มะเดช นักการเมืองในพื้นที่ ให้การต้อนรับผู้สื่อข่าวรายงานว่า การลงพื้นที่ในครั้งนี้ของ นายสมศักดิ์ ต้องขึ้นเฮลิคอปเตอร์จากท่าอากาศยานนานาชาติแม่สอด เพื่อเปิดงานการสถาปนาเขตพื้นที่คุ้มครองวิถีชีวิตกลุ่มชาติพันธุ์ บ้านขุนแม่เหว่ย (แม่ปอคี) เนื่องจากระยะทางการเข้าพื้นที่เป็นไปด้วยความยากลำบาก พร้อมทั้งยังร่วมเป็นสักขีพยานในการลงบันทึก MOU ร่วมกับ 22 หน่วยงาน เช่น กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม (ทส.) กระทรวงศึกษาธิการ (ศธ.) กระทรวงสาธารณสุข (สธ.) กระทรวงพัฒนาสังคมและความมั่นคงของมนุษย์ (พม.) เป็นต้น พร้อมกันนี้ยังได้มีการลงพื้นที่ติดตามระบบโทรมาตรอัตโนมัติ ซึ่งเป็นเครื่องมือที่ใช้เก็บข้อมูล สถานการณ์น้ำ แผนการจัดการน้ำ เตือนอุทกภัยน้ำหลากโดย นายสมศักดิ์ กล่าวว่า ตนมีความยินดีอย่างยิ่งที่ได้มาเยือนและพบปะพี่น้อง กลุ่มชาติพันธุ์ชาวกะเหรี่ยง การร่วมสถาปนาเขตพื้นที่คุ้มครองวิถีชีวิตกลุ่มชาติพันธุ์บ้านขุนแม่เหว่ย (แม่ปอคี) เป็นพื้นที่คุ้มครองวิถีชีวิตกลุ่มชาติพันธุ์ลำดับที่ 22 ถือเป็นเรื่องที่น่ายินดีอย่างยิ่ง ตนในฐานะของตัวแทนรัฐบาลขอยืนยันว่า นายเศรษฐา ทวีสิน นายกรัฐมนตรี ให้ความสำคัญในเรื่องของกลุ่มชาติพันธุ์เป็นอย่างมาก ท่านนายกฯ ต้องการพัฒนาคุณภาพชีวิต การยอมรับความหลากหลายทางอัตลักษณ์ ความเสมอภาคเท่าเทียมและสิทธิพื้นฐานที่กลุ่มชาติพันธุ์จะได้รับนายสมศักดิ์ กล่าวต่อว่า ในส่วนเรื่องของกฎหมาย รัฐบาลได้ผลักดันพระราชบัญญัติคุ้มครองและส่งเสริมวิถีชีวิตกลุ่มชาติพันธุ์ ซึ่งรัฐบาลได้เสนอร่างดังกล่าวต่อสภาผู้แทนราษฎรไปเมื่อวันที่ 28 กุมภาพันธ์ 2567 โดยที่ประชุมมีมติ 414 เสียง และรับหลักการในวาระหนึ่งเป็นที่เรียบร้อย ปัจจุบันร่างกฎหมายดังกล่าว อยู่ระหว่างการพิจารณาของคณะกรรมการวิสามัญร่วมกับร่างกฎหมาย จากภาคประชาชนและพรรคการเมืองรวมเป็น 5 ฉบับ นี่ก็ทำให้เห็นว่าทุกภาคส่วนให้ความสำคัญกับพี่น้องทุกท่าน และผมหวังว่ากฎหมายฉบับนี้จะแล้วเสร็จได้อย่างรวดเร็วผมขอยืนยันว่า รัฐบาลให้การสนับสนุนพี่น้องกลุ่มชาติพันธุ์ทุกกลุ่มอย่างเสมอภาค เพื่อให้เกิดการอยู่ร่วมกันอย่างมีเกียรติ มีศักดิ์ศรี และอยากเห็นกลุ่มชาติพันธุ์มีคุณภาพชีวิตที่ดีขึ้น มีรายได้ มีที่ดินทำกิน ดังนั้นทุกท่านต้องให้ความร่วมมือกับส่วนราชการ เดินหน้าให้ชุมชนสร้างประโยชน์ในพื้นที่ และให้มีส่วนร่วมในการบริหารจัดการในพื้นที่ตัวเอง การสถาปนาในวันนี้จะช่วยส่งเสริมการอนุรักษ์ทรัพยากรธรรมชาติ และที่สำคัญที่สุด คือ การสร้างความมั่นคงให้กับชีวิต สามารถพึ่งพาตัวเองได้ และผมยังหวังว่าอีกไม่นานนี้ หากทุกท่านร่วมมือกันเราจะมีเขตพื้นที่คุ้มครองวิถีชีวิตชาติพันธุ์ ในระดับที่ 23 ต่อไปครับ รองนายกรัฐมนตรีกล่าวด้าน นายสุรสีห์ เปิดเผยว่า จากการติดตามในพื้นที่ของ สทนช.พบปัญหาด้านน้ำอุปโภคบริโภคยังไม่ได้คุณภาพ จากนี้ไปจะติดตามและประสานหน่วยงานเพื่อเร่งดำเนินการแก้ไขนอกจากนี้ นายสมศักดิ์ ยังกล่าวอีกว่า บ้านขุนแม่เหว่ยเป็นพื้นที่ประวัติศาสตร์ มากว่า 425 ปี เวลานี้มีประชากร 276 คน 51 หลังคาเรือน มีพื้นที่ 8,386 ไร่ ทำภาคเกษตรหมุนเวียนเป็นส่วนมาก ดังนั้นเวลานี้รัฐบาลโดยคณะรัฐมนตรีที่มีท่านนายกฯ เศรษฐาเป็นผู้นำ ได้เห็นชอบโครงการโคแสนล้าน เพื่อต้องการให้พี่น้องเกษตรกรมีรายได้เสริมและมีชีวิตความเป็นอยู่ที่ดีขึ้น ขณะเดียวกันพื้นที่นี้มีความเหมาะสมในการทำปศุสัตว์ เพราะโคไม่ไปทำลายต้นไม้ ดังนั้นจะประสานให้กองทุนหมู่บ้านทำความเข้าใจ และถ่ายทอดความรู้ให้แก่พี่น้องบ้านขุนแม่เหว่ยว่า จะเข้าร่วมโครงการได้แบบใดบ้างผู้สื่อข่าวรายงานว่า ในการลงพื้นที่โครงการโคแสนล้านได้รับความสนใจเป็นอย่างมาก จากพี่น้องชาวชาติพันธุ์เพราะมองว่าเป็นโอกาส พร้อมกันนี้รองนายกฯ ยังได้มอบเชือกวัดน้ำหนักโคให้เป็นที่ระลึกอีกด้วย"))

    


 


